andrewparlane/kinetis_test_projects/frdm_k66f_board/screen_test/tests/test2.c
    // display it
    res = ft81x_graphics_engine_write_display_list_cmd(handle, FT81X_DL_CMD_DISPLAY());
    if (res != FT81X_RESULT_OK)
    {
        DbgConsole_Printf("ft81x_graphics_engine_write_display_list_cmd failed with %u\n", res);
        return res;
    }

    // write everything to the DL ram and then swap it in
    res = ft81x_graphics_engine_end_display_list(handle);
    if (res != FT81X_RESULT_OK)
    {
        DbgConsole_Printf("ft81x_graphics_engine_end_display_list failed with %u\n", res);
        return res;
    }

    vTaskDelay(3000);

    return FT81X_RESULT_OK;
}

ft81x_result test2_text(FT81X_Handle *handle)
{
    ft81x_result res;

    // ----------------------------------------------------------
    // load our custom font into g RAM
    // ----------------------------------------------------------
    FT81X_Font_Handle blink_font_handle;
    res = ft81x_text_manager_load_custom_font(handle, &blink_font_l2_raw_font_properties, &blink_font_handle);
    if (res != FT81X_RESULT_OK)
    {
        DbgConsole_Printf("ft81x_text_manager_load_custom_font failed with %u\n", res);
        return res;
    }

    // ----------------------------------------------------------
    // Get font handles for inbuilt fonts
    // ----------------------------------------------------------
    FT81X_Font_Handle inbuilt_31_font_handle;
    res = ft81x_text_manager_get_font_handle_for_inbuilt_font(handle, &inbuilt_31_font_handle, 31);
    if (res != FT81X_RESULT_OK)
    {
        DbgConsole_Printf("ft81x_text_manager_get_font_handle_for_inbuilt_font failed with %u\n", res);
        return res;
    }

    // ----------------------------------------------------------
    // Build and display the display list
    // ----------------------------------------------------------
    // reset the co-proc to it's default state
    res = ft81x_coproc_cmd_coldstart(handle);
    if (res != FT81X_RESULT_OK)
    {
        DbgConsole_Printf("ft81x_coproc_cmd_coldstart failed with %u\n", res);
        return res;
    }

    // clear the screen
    res = ft81x_graphics_engine_write_display_list_snippet(handle, sizeof(clear_dl_snippet), clear_dl_snippet);
    if (res != FT81X_RESULT_OK)
    {
        DbgConsole_Printf("ft81x_graphics_engine_write_display_list_snippet failed with %u\n", res);
        return res;
    }

    // initialise the custom font
    // note: don't need to init inbuilt fonts
    // the API lets you, it just won't do anything
    res = ft81x_text_manager_send_font_init_dl(handle,
                                               &blink_font_l2_raw_font_properties,
                                               &blink_font_handle,
                                               FT81X_BITMAP_FILTER_NEAREST,
                                               FT81X_BITMAP_WRAP_BORDER,
                                               FT81X_BITMAP_WRAP_BORDER);
    if (res != FT81X_RESULT_OK)
    {
        DbgConsole_Printf("ft81x_text_manager_send_font_init_dl failed with %u\n", res);
        return res;
    }

    // change the colour for the folowwing text
    res = ft81x_graphics_engine_write_display_list_cmd(handle, FT81X_DL_CMD_COLOUR_RGB(255, 0, 0));
    if (res != FT81X_RESULT_OK)
    {
        DbgConsole_Printf("ft81x_graphics_engine_write_display_list_cmd failed with %u\n", res);
        return res;
    }

    // show some text
    res = ft81x_text_manager_write_text(handle, &inbuilt_31_font_handle, 10, 30, FT81X_TEXT_COORDS_TOP_LEFT, "Test 2");
    if (res != FT81X_RESULT_OK)
    {
        DbgConsole_Printf("ft81x_text_manager_write_text failed with %u\n", res);
        return res;
    }

    // show some numbers
    res = ft81x_text_manager_write_unsigned_number(handle, &inbuilt_31_font_handle, 10, 100, FT81X_TEXT_COORDS_TOP_LEFT, 0xFFFFFFFF);
    if (res != FT81X_RESULT_OK)
    {
        DbgConsole_Printf("ft81x_text_manager_write_unsigned_number failed with %u\n", res);
        return res;
    }

    res = ft81x_text_manager_write_signed_number(handle, &inbuilt_31_font_handle, 10, 150, FT81X_TEXT_COORDS_TOP_LEFT, (int32_t)0xFFFFFFFF);
    if (res != FT81X_RESULT_OK)
    {
        DbgConsole_Printf("ft81x_text_manager_write_signed_number failed with %u\n", res);
        return res;
    }

    // custom font text (note I replaced the data for ~ with a smiley)
    res = ft81x_text_manager_write_text(handle, &blink_font_handle, 10, 200, FT81X_TEXT_COORDS_TOP_LEFT, "Custom Font -> ~");
    if (res != FT81X_RESULT_OK)
    {
        DbgConsole_Printf("ft81x_text_manager_write_text failed with %u\n", res);
        return res;
    }

    // numbers with custom font
    res = ft81x_text_manager_write_unsigned_number(handle, &blink_font_handle, 10, 230, FT81X_TEXT_COORDS_TOP_LEFT, (uint32_t)-1);
    if (res != FT81X_RESULT_OK)
    {
        DbgConsole_Printf("ft81x_text_manager_write_unsigned_number failed with %u\n", res);
        return res;
    }

    res = ft81x_text_manager_write_signed_number(handle, &blink_font_handle, 10, 260, FT81X_TEXT_COORDS_TOP_LEFT, -1);
    if (res != FT81X_RESULT_OK)
    {
        DbgConsole_Printf("ft81x_text_manager_write_signed_number failed with %u\n", res);
        return res;
    }

    res = ft81x_text_manager_write_unsigned_number(handle, &blink_font_handle, 10, 290, FT81X_TEXT_COORDS_TOP_LEFT, 1337);
    if (res != FT81X_RESULT_OK)
    {
        DbgConsole_Printf("ft81x_text_manager_write_unsigned_number failed with %u\n", res);
        return res;
    }

    // display it
    res = ft81x_graphics_engine_write_display_list_cmd(handle, FT81X_DL_CMD_DISPLAY());
    if (res != FT81X_RESULT_OK)
    {
        DbgConsole_Printf("ft81x_graphics_engine_write_display_list_cmd failed with %u\n", res);
        return res;
    }

    // write everything to the DL ram and then swap it in
    res = ft81x_graphics_engine_end_display_list(handle);
    if (res != FT81X_RESULT_OK)
    {
        DbgConsole_Printf("ft81x_graphics_engine_end_display_list failed with %u\n", res);
        return res;
    }

    vTaskDelay(3000);

