andrewparlane/kinetis_test_projects/frdm_k66f_board/screen_test/tests/test2.c
    return FT81X_RESULT_OK;
}

ft81x_result test2_buttons(FT81X_Handle *handle)
{
    ft81x_result res;

    // reset the co-proc to it's default state
    res = ft81x_coproc_cmd_coldstart(handle);
    if (res != FT81X_RESULT_OK)
    {
        DbgConsole_Printf("ft81x_coproc_cmd_coldstart failed with %u\n", res);
        return res;
    }

    // clear the screen
    res = ft81x_graphics_engine_write_display_list_snippet(handle, sizeof(clear_dl_snippet), clear_dl_snippet);
    if (res != FT81X_RESULT_OK)
    {
        DbgConsole_Printf("ft81x_graphics_engine_write_display_list_snippet failed with %u\n", res);
        return res;
    }

    // draw a default button
    res = ft81x_coproc_cmd_button(handle, 10, 10, 200, 100, 24, 0, "button1");
    if (res != FT81X_RESULT_OK)
    {
        DbgConsole_Printf("ft81x_coproc_cmd_button failed with %u\n", res);
        return res;
    }

    // change the fg colour to red
    res = ft81x_coproc_cmd_fgcolour(handle, 255, 0, 0);
    if (res != FT81X_RESULT_OK)
    {
        DbgConsole_Printf("ft81x_coproc_fgcolour failed with %u\n", res);
        return res;
    }

    // draw a flat button
    res = ft81x_coproc_cmd_button(handle, 10, 120, 200, 100, 24, FT81X_COPROC_OPTION_FLAT, "flat button");
    if (res != FT81X_RESULT_OK)
    {
        DbgConsole_Printf("ft81x_coproc_cmd_button failed with %u\n", res);
        return res;
    }

    // change the fg colour to dark yellow
    res = ft81x_coproc_cmd_fgcolour(handle, 32, 32, 0);
    if (res != FT81X_RESULT_OK)
    {
        DbgConsole_Printf("ft81x_coproc_fgcolour failed with %u\n", res);
        return res;
    }

    // set the gradient colour to blue
    res = ft81x_coproc_cmd_gradcolour(handle, 0, 0, 255);
    if (res != FT81X_RESULT_OK)
    {
        DbgConsole_Printf("ft81x_coproc_cmd_gradcolour failed with %u\n", res);
        return res;
    }

    // draw another button
    res = ft81x_coproc_cmd_button(handle, 10, 220, 250, 200, 28, 0, "button 3 with gradient");
    if (res != FT81X_RESULT_OK)
    {
        DbgConsole_Printf("ft81x_coproc_cmd_button failed with %u\n", res);
        return res;
    }

    // display it
    res = ft81x_graphics_engine_write_display_list_cmd(handle, FT81X_DL_CMD_DISPLAY());
    if (res != FT81X_RESULT_OK)
    {
        DbgConsole_Printf("ft81x_graphics_engine_write_display_list_cmd failed with %u\n", res);
        return res;
    }

    // write everything to the DL ram and then swap it in
    res = ft81x_graphics_engine_end_display_list(handle);
    if (res != FT81X_RESULT_OK)
    {
        DbgConsole_Printf("ft81x_graphics_engine_end_display_list failed with %u\n", res);
        return res;
    }

    vTaskDelay(3000);

    return FT81X_RESULT_OK;
}

ft81x_result test2_clocks_and_guages(FT81X_Handle *handle)
{
    ft81x_result res;

    // reset the co-proc to it's default state
    res = ft81x_coproc_cmd_coldstart(handle);
    if (res != FT81X_RESULT_OK)
    {
        DbgConsole_Printf("ft81x_coproc_cmd_coldstart failed with %u\n", res);
        return res;
    }

    // clear the screen
    res = ft81x_graphics_engine_write_display_list_snippet(handle, sizeof(clear_dl_snippet), clear_dl_snippet);
    if (res != FT81X_RESULT_OK)
    {
        DbgConsole_Printf("ft81x_graphics_engine_write_display_list_snippet failed with %u\n", res);
        return res;
    }

    // draw a default clock
    res = ft81x_coproc_cmd_clock(handle, 50, 50, 50, 0, 6, 30, 15, 500);
    if (res != FT81X_RESULT_OK)
    {
        DbgConsole_Printf("ft81x_coproc_cmd_clock failed with %u\n", res);
        return res;
    }

    // draw a default gauge
    res = ft81x_coproc_cmd_gauge(handle, 250, 50, 50, 0, 5, 2, 75, 100);
    if (res != FT81X_RESULT_OK)
    {
        DbgConsole_Printf("ft81x_coproc_cmd_clock failed with %u\n", res);
        return res;
    }

    // change the bg colour to green
    res = ft81x_coproc_cmd_bgcolour(handle, 0, 255, 0);
    if (res != FT81X_RESULT_OK)
    {
        DbgConsole_Printf("ft81x_coproc_bgcolour failed with %u\n", res);
        return res;
    }

    // draw a flat clock with no ticks
    res = ft81x_coproc_cmd_clock(handle, 50, 170, 60, FT81X_COPROC_OPTION_FLAT | FT81X_COPROC_OPTION_NOTICKS, 3, 45, 35, 100);
    if (res != FT81X_RESULT_OK)
    {
        DbgConsole_Printf("ft81x_coproc_cmd_clock failed with %u\n", res);
        return res;
    }

    // draw a flat gauge with no ticks
    res = ft81x_coproc_cmd_gauge(handle, 250, 170, 60, FT81X_COPROC_OPTION_FLAT | FT81X_COPROC_OPTION_NOTICKS, 5, 1, 25, 100);
    if (res != FT81X_RESULT_OK)
    {
        DbgConsole_Printf("ft81x_coproc_cmd_clock failed with %u\n", res);
        return res;
    }

    // draw a clock with no hands and no background
    res = ft81x_coproc_cmd_clock(handle, 100, 300, 90, FT81X_COPROC_OPTION_NOBACK | FT81X_COPROC_OPTION_NOHANDS, 3, 45, 35, 100);
    if (res != FT81X_RESULT_OK)
    {
        DbgConsole_Printf("ft81x_coproc_cmd_clock failed with %u\n", res);
        return res;
    }

    // draw a gauge with no pointer and no background
    res = ft81x_coproc_cmd_gauge(handle, 250, 300, 90, FT81X_COPROC_OPTION_NOPOINTER | FT81X_COPROC_OPTION_NOBACK, 2, 10, 25, 100);
    if (res != FT81X_RESULT_OK)
    {
        DbgConsole_Printf("ft81x_coproc_cmd_clock failed with %u\n", res);
        return res;
    }

    // display it
    res = ft81x_graphics_engine_write_display_list_cmd(handle, FT81X_DL_CMD_DISPLAY());
    if (res != FT81X_RESULT_OK)
    {
        DbgConsole_Printf("ft81x_graphics_engine_write_display_list_cmd failed with %u\n", res);
        return res;
    }

    // write everything to the DL ram and then swap it in
    res = ft81x_graphics_engine_end_display_list(handle);
    if (res != FT81X_RESULT_OK)
    {
        DbgConsole_Printf("ft81x_graphics_engine_end_display_list failed with %u\n", res);
        return res;
    }

    vTaskDelay(3000);

    return FT81X_RESULT_OK;
}

ft81x_result test2_keys_dials_toggles(FT81X_Handle *handle)
{
    ft81x_result res;

