andrewparlane/kinetis_test_projects/frdm_k66f_board/screen_test/tests/test2.c
    // reset the co-proc to it's default state
    res = ft81x_coproc_cmd_coldstart(handle);
    if (res != FT81X_RESULT_OK)
    {
        DbgConsole_Printf("ft81x_coproc_cmd_coldstart failed with %u\n", res);
        return res;
    }

    // clear the screen
    res = ft81x_graphics_engine_write_display_list_snippet(handle, sizeof(clear_dl_snippet), clear_dl_snippet);
    if (res != FT81X_RESULT_OK)
    {
        DbgConsole_Printf("ft81x_graphics_engine_write_display_list_snippet failed with %u\n", res);
        return res;
    }

    // draw some keys
    res = ft81x_coproc_cmd_keys(handle, 50, 50, 270, 50, 23, 'a', "aaAbBcC");
    if (res != FT81X_RESULT_OK)
    {
        DbgConsole_Printf("ft81x_coproc_cmd_clock failed with %u\n", res);
        return res;
    }

    // draw a dial
    res = ft81x_coproc_cmd_dial(handle, 80, 240, 80, 0, 0x2000);
    if (res != FT81X_RESULT_OK)
    {
        DbgConsole_Printf("ft81x_coproc_cmd_dial failed with %u\n", res);
        return res;
    }

    // draw a toggle
    res = ft81x_coproc_cmd_toggle(handle, 50, 330, 80, 23, 0, 0, "off\xffon");
    if (res != FT81X_RESULT_OK)
    {
        DbgConsole_Printf("ft81x_coproc_cmd_toggle failed with %u\n", res);
        return res;
    }

    // change the fg colour to red
    res = ft81x_coproc_cmd_fgcolour(handle, 255, 0, 0);
    if (res != FT81X_RESULT_OK)
    {
        DbgConsole_Printf("ft81x_coproc_fgcolour failed with %u\n", res);
        return res;
    }

    // change the bg colour to white
    res = ft81x_coproc_cmd_bgcolour(handle, 255, 255, 255);
    if (res != FT81X_RESULT_OK)
    {
        DbgConsole_Printf("ft81x_coproc_bgcolour failed with %u\n", res);
        return res;
    }

    // set the text colour to black
    res = ft81x_graphics_engine_write_display_list_cmd(handle, FT81X_DL_CMD_COLOUR_RGB(0,0,0));
    if (res != FT81X_RESULT_OK)
    {
        DbgConsole_Printf("ft81x_graphics_engine_write_display_list_cmd failed with %u\n", res);
        return res;
    }

    // change the grad colour to blue
    res = ft81x_coproc_cmd_gradcolour(handle, 0, 0, 255);
    if (res != FT81X_RESULT_OK)
    {
        DbgConsole_Printf("ft81x_coproc_cmd_gradcolour failed with %u\n", res);
        return res;
    }

    // draw some keys
    res = ft81x_coproc_cmd_keys(handle, 50, 110, 250, 50, 23, FT81X_COPROC_OPTION_CENTRE | 'B', "aAbBcC123");
    if (res != FT81X_RESULT_OK)
    {
        DbgConsole_Printf("ft81x_coproc_cmd_clock failed with %u\n", res);
        return res;
    }

    // draw a flat dial
    res = ft81x_coproc_cmd_dial(handle, 240, 240, 80, FT81X_COPROC_OPTION_FLAT, 6000);
    if (res != FT81X_RESULT_OK)
    {
        DbgConsole_Printf("ft81x_coproc_cmd_dial failed with %u\n", res);
        return res;
    }

    // draw a flat toggle
    res = ft81x_coproc_cmd_toggle(handle, 190, 330, 80, 23, 0, 1, "off\xffon");
    if (res != FT81X_RESULT_OK)
    {
        DbgConsole_Printf("ft81x_coproc_cmd_toggle failed with %u\n", res);
        return res;
    }

    // display it
    res = ft81x_graphics_engine_write_display_list_cmd(handle, FT81X_DL_CMD_DISPLAY());
    if (res != FT81X_RESULT_OK)
    {
        DbgConsole_Printf("ft81x_graphics_engine_write_display_list_cmd failed with %u\n", res);
        return res;
    }

    // write everything to the DL ram and then swap it in
    res = ft81x_graphics_engine_end_display_list(handle);
    if (res != FT81X_RESULT_OK)
    {
        DbgConsole_Printf("ft81x_graphics_engine_end_display_list failed with %u\n", res);
        return res;
    }

    vTaskDelay(3000);

    return FT81X_RESULT_OK;
}

ft81x_result test2_gradient(FT81X_Handle *handle)
{
    ft81x_result res;

    // reset the co-proc to it's default state
    res = ft81x_coproc_cmd_coldstart(handle);
    if (res != FT81X_RESULT_OK)
    {
        DbgConsole_Printf("ft81x_coproc_cmd_coldstart failed with %u\n", res);
        return res;
    }

    // clear the screen
    res = ft81x_graphics_engine_write_display_list_snippet(handle, sizeof(clear_dl_snippet), clear_dl_snippet);
    if (res != FT81X_RESULT_OK)
    {
        DbgConsole_Printf("ft81x_graphics_engine_write_display_list_snippet failed with %u\n", res);
        return res;
    }

    // show a gradient
    res = ft81x_coproc_cmd_gradient(handle, 200, 100, 255, 0, 0, 300, 400, 0, 0, 255);
    if (res != FT81X_RESULT_OK)
    {
        DbgConsole_Printf("ft81x_coproc_cmd_gradient failed with %u\n", res);
        return res;
    }

#warning TODO: add support for scissor commands then improve test2_gradient()

    // display it
    res = ft81x_graphics_engine_write_display_list_cmd(handle, FT81X_DL_CMD_DISPLAY());
    if (res != FT81X_RESULT_OK)
    {
        DbgConsole_Printf("ft81x_graphics_engine_write_display_list_cmd failed with %u\n", res);
        return res;
    }

    // write everything to the DL ram and then swap it in
    res = ft81x_graphics_engine_end_display_list(handle);
    if (res != FT81X_RESULT_OK)
    {
        DbgConsole_Printf("ft81x_graphics_engine_end_display_list failed with %u\n", res);
        return res;
    }

    vTaskDelay(3000);

    return FT81X_RESULT_OK;
}

ft81x_result test2_progress_scrollbars_sliders(FT81X_Handle *handle)
{
    ft81x_result res;

    for (int i = 0; i <= 100; i++)
    {
        // reset the co-proc to it's default state
        res = ft81x_coproc_cmd_coldstart(handle);
        if (res != FT81X_RESULT_OK)
        {
            DbgConsole_Printf("ft81x_coproc_cmd_coldstart failed with %u\n", res);
            return res;
        }

        // clear the screen
        res = ft81x_graphics_engine_write_display_list_snippet(handle, sizeof(clear_dl_snippet), clear_dl_snippet);
        if (res != FT81X_RESULT_OK)
        {
            DbgConsole_Printf("ft81x_graphics_engine_write_display_list_snippet failed with %u\n", res);
            return res;
        }

        // show a progress bar
        res = ft81x_coproc_cmd_progress(handle, 50, 50, 220, 30, 0, i, 100);
        if (res != FT81X_RESULT_OK)
        {
            DbgConsole_Printf("ft81x_coproc_cmd_progress failed with %u\n", res);
            return res;
        }

        // show a horizontal scrollbar
        res = ft81x_coproc_cmd_scrollbar(handle, 0, 460, 320, 20, 0, i, 10, 110);
        if (res != FT81X_RESULT_OK)
        {
            DbgConsole_Printf("ft81x_coproc_cmd_scrollbar failed with %u\n", res);
            return res;
        }

        // show a vertical scrollbar
        res = ft81x_coproc_cmd_scrollbar(handle, 300, 0, 20, 480, 0, i, 30, 130);
        if (res != FT81X_RESULT_OK)
        {
            DbgConsole_Printf("ft81x_coproc_cmd_scrollbar failed with %u\n", res);
            return res;
        }

